{
  "backend/main.mo": "Motoko canister defining user profiles, SOS events, hazards, and authorization‑gated CRUD with ID generation.",
  "feature_evidence.json": "Feature evidence report listing features, related files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries of all frontend files for reference in build planning.",
  "frontend/index.css": "Tailwind CSS setup defining theme variables and base styles for light and dark modes.",
  "frontend/index.html": "Base HTML entry point loading manifest, icons, and main React app root.",
  "frontend/public/manifest.json": "PWA manifest defining app metadata, start URL, theme colors, and icons.",
  "frontend/public/service-worker.js": "Simple service worker implementing install-time caching, cache‑first fetch, and old cache cleanup.",
  "frontend/src/App.tsx": "Main React app configuring routes, providers, service worker registration, sync manager, and SOS reconciliation.",
  "frontend/src/components/ConnectivityIndicator.tsx": "UI component showing online status, syncing, and queued offline actions with auth-aware messaging.",
  "frontend/src/components/Footer.tsx": "Footer displaying copyright and a caffeine.ai attribution link with tracking.",
  "frontend/src/components/Header.tsx": "Responsive app header with navigation links, mobile sidebar menu, and auth bar.",
  "frontend/src/components/Layout.tsx": "Page layout component that renders header, footer, connectivity indicator, SOS controller, crash dialog, and routed content.",
  "frontend/src/features/auth/AuthBar.tsx": "Authentication UI that handles login/logout via Internet Identity and shows a user dropdown when logged in.",
  "frontend/src/features/bluetooth/BluetoothRelayCard.tsx": "UI card for connecting to a Bluetooth device, sending messages, viewing logs, and handling connection state and errors.",
  "frontend/src/features/bluetooth/useBluetoothRelay.ts": "Zustand-based hook managing Web Bluetooth connection state, message handling, error parsing, and device references.",
  "frontend/src/features/contacts/contactsStore.ts": "Zustand store and React Query logic for managing emergency contacts locally or via backend depending on authentication state.",
  "frontend/src/features/fatigue/FatigueCheckDialog.tsx": "Dialog prompting the user for a fatigue check based on periodic triggers from useFatiguePrompts.",
  "frontend/src/features/fatigue/useFatiguePrompts.ts": "Hook that triggers periodic fatigue checks based on user settings and session timing.",
  "frontend/src/features/hazards/HazardReportForm.tsx": "Form component for submitting hazard reports with type, severity, description, and current location, enqueueing submissions for offline handling.",
  "frontend/src/features/hazards/HazardsList.tsx": "Displays nearby hazards with filtering by radius, using fetched hazard data and showing details like type, severity, location, and time.",
  "frontend/src/features/hazards/hazardTypes.ts": "Defines hazard type and severity constants and helper functions to map values to display labels.",
  "frontend/src/features/hazards/useNearbyHazards.ts": "Hook that fetches hazards near the user’s location via an actor, handling loading and error states.",
  "frontend/src/features/location/LastKnownLocationCard.tsx": "Card component showing the user’s last known location or location access errors.",
  "frontend/src/features/location/useBreadcrumbTracking.ts": "Provides live geolocation tracking and optionally records breadcrumb points during an active SOS event.",
  "frontend/src/features/permissions/usePermissionStatus.ts": "Hook for checking and requesting location and motion permissions with real-time state updates.",
  "frontend/src/features/profile/ProfileSetupDialog.tsx": "Dialog prompting authenticated users without a profile to enter and save their name and optional handle.",
  "frontend/src/features/profile/useUserProfile.ts": "Hooks for fetching and saving the current user's profile via actor calls with React Query.",
  "frontend/src/features/sensors/CrashPromptDialog.tsx": "Dialog triggered by crash detection that prompts the user to confirm safety or start an SOS event.",
  "frontend/src/features/sensors/useCrashDetection.ts": "Hook that listens to device motion, computes g‑force, and triggers a crash callback when threshold conditions are met with cooldown handling.",
  "frontend/src/features/sos/shareLink.ts": "Generates a shareable SOS status URL from an SOS ID.",
  "frontend/src/features/sos/sosBluetoothMessage.ts": "Formats an SOS event into a human‑readable Bluetooth message including note, timestamp, and optional share link.",
  "frontend/src/features/sos/SOSController.tsx": "UI controller for starting, ending, sharing, and Bluetooth‑relaying SOS events with dialogs, identity checks, and status badges.",
  "frontend/src/features/sos/sosState.ts": "Zustand store managing active SOS state and async helpers to enqueue start/end/breadcrumb actions for offline processing.",
  "frontend/src/hooks/useActor.ts": "Hook that creates and manages a backend actor tied to the user’s identity and invalidates dependent queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context and provider for Internet Identity authentication, exposing identity state, login, and logout handlers.",
  "frontend/src/hooks/useOnlineStatus.ts": "Hook that tracks browser online/offline status via window events.",
  "frontend/src/hooks/useQueries.ts": "Placeholder file exporting nothing; queries handled elsewhere.",
  "frontend/src/index.css": "Global Tailwind CSS setup defining theme variables for light and dark modes.",
  "frontend/src/main.tsx": "Main entry rendering the app with React Query and Internet Identity providers.",
  "frontend/src/offline/queue.ts": "IndexedDB‑backed queue system for storing and updating offline SOS‑related actions with status and retry tracking.",
  "frontend/src/offline/sync.ts": "Manages offline queue syncing by periodically sending queued SOS and hazard actions to the backend and updating shared sync state.",
  "frontend/src/pages/ContactsPage.tsx": "Provides a UI for viewing, adding, editing, and deleting emergency contacts using a modal form.",
  "frontend/src/pages/HazardsPage.tsx": "Displays tabs for submitting hazard reports and viewing nearby hazards.",
  "frontend/src/pages/HomePage.tsx": "Shows the app’s home dashboard with SOS status, safety features, and last known location.",
  "frontend/src/pages/SettingsPage.tsx": "Allows users to configure safety settings, permissions, and view queued offline items.",
  "frontend/src/pages/SOSStatusPage.tsx": "Fetches and displays detailed status information for a specific SOS event including breadcrumbs and timestamps.",
  "frontend/src/pwa/registerServiceWorker.ts": "Registers the service worker on page load for PWA functionality.",
  "frontend/src/state/settingsStore.ts": "Zustand store for persisted user settings with validation for crash threshold values.",
  "frontend/src/utils/urlParams.ts": "Provides helpers to read URL params (including hash routing), persist them in sessionStorage, and clear them from the URL.",
  "frontend/tailwind.config.js": "Tailwind CSS config extending colors, layout, animations, and enabling typography, container queries, and animation plugins.",
  "project_state.json": "Defines the project’s state, goals, architecture notes, existing features, and known issues for an offline-first SOS mobile app."
}